{
  "backend/main.mo": "Motoko actor defining institutions, students, SPP settings, payments, user profiles, and role-based access control with storage and comparison helpers.",
  "feature_evidence.json": "Feature evidence report listing implemented localization and institution dropdown functionalities with associated files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of all major frontend files describing their responsibilities and Indonesian-localized behavior.",
  "frontend/index.css": "Tailwind base theme defining color tokens, dark mode variables, and global styling rules.",
  "frontend/index.html": "HTML entry point loading Inter font and mounting the root React application.",
  "frontend/src/App.tsx": "Main React app configuring routes, theme, authentication gating, profile setup modal, and global providers.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with Indonesian status text and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal form for creating a user profile, handling name, role, institution selection, and saving via mutation.",
  "frontend/src/components/auth/RequireAuth.tsx": "Wrapper that checks Internet Identity login state and displays a login prompt if unauthenticated.",
  "frontend/src/components/layout/AdminLayout.tsx": "Main admin layout with header, sidebar navigation, mobile menu, theme toggle, and content area.",
  "frontend/src/components/theme/ThemeToggle.tsx": "Button component that toggles between light and dark themes using next-themes.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages the backend actor based on Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Hook for fetching the current user's profile using the actor, managing loading and fetch states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider managing Internet Identity authentication, login, logout, and stored identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for student, institution, payment, and profile operations using the backend actor.",
  "frontend/src/index.css": "Defines Tailwind layers and extensive light/dark theme color variables and applies global base styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/calendar/PaymentCalendarPage.tsx": "Displays a placeholder page for the upcoming payment calendar feature.",
  "frontend/src/pages/dashboard/DashboardPage.tsx": "Builds the dashboard with stats, charts, and monthly/institutional payment summaries using queried data.",
  "frontend/src/pages/payments/PaymentDetailPage.tsx": "Shows detailed payment info with actions for printing, downloading, editing, and handling loading/not-found states.",
  "frontend/src/pages/payments/PaymentFormPage.tsx": "Implements create/edit payment form logic, loading payment data, handling submission, and managing form state.",
  "frontend/src/pages/payments/PaymentsListPage.tsx": "Lists payments with search, delete confirmation, and navigation to create or view details.",
  "frontend/src/pages/reports/ArrearsReportPage.tsx": "Placeholder page for arrears reports with print and export buttons.",
  "frontend/src/pages/reports/ClassRecapReportPage.tsx": "Displays class recap report placeholder with navigation and print/export buttons.",
  "frontend/src/pages/reports/InstitutionRecapReportPage.tsx": "Shows institution recap report placeholder including navigation and print/export controls.",
  "frontend/src/pages/reports/MonthlyRecapReportPage.tsx": "Renders monthly recap report placeholder with back navigation and export options.",
  "frontend/src/pages/reports/ReportsIndexPage.tsx": "Lists available report types and navigates to each report page.",
  "frontend/src/pages/settings/SppSettingsPage.tsx": "Provides SPP settings page with placeholder for configuring SPP rates.",
  "frontend/src/pages/students/StudentDetailPage.tsx": "Displays detailed student info and payment history with edit and back navigation.",
  "frontend/src/pages/students/StudentFormPage.tsx": "Form for creating or editing student data with validation and submission handling.",
  "frontend/src/pages/students/StudentsImportPage.tsx": "Shows placeholder interface for importing students from an Excel file.",
  "frontend/src/pages/students/StudentsListPage.tsx": "Lists students with search, add, import, and delete functionality.",
  "frontend/src/utils/formatters.ts": "Contains date and currency formatting utilities for Indonesian locale.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash-based), persist them in sessionStorage, and clear stored or hash parameters.",
  "frontend/tailwind.config.js": "Configures Tailwind with extended colors, fonts, container settings, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores the project’s current architecture, approved features, issues, and metadata for the school payment management web app."
}