{
  "kind": "build_request",
  "title": "Full Indonesian UI localization and fix empty Institution dropdown (SMP/SMA)",
  "projectName": "SPP Sekolah",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-15",
      "text": "Fix institution listing so the Institution dropdown can reliably show the two predefined institutions (SMP and SMA) even when the authenticated user does not yet have a user profile, and ensure the backend always has the two predefined institutions available.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "apk nya masih full bahasa inggris... dropdown lembaga itu belum ada SMP atau SMA masih kosong tolong langsung perbaiki",
          "iya bro perbaiki pokonya dan jangan lupa ubah pake bahasa indonesia aja"
        ]
      },
      "acceptanceCriteria": [
        "When an authenticated user has no saved profile yet, calling listInstitutions() succeeds (does not trap) and returns the predefined institutions.",
        "If the institutions store is empty, the backend automatically makes the two predefined institutions available: “SMP IT TAHFIDHIL QUR'AN AL-MUSTAQIMIYYAH” and “SMA TAHFIDHIL QUR'AN AL-MUSTAQIMIYYAH”.",
        "saveCallerUserProfile validates institutionId against those predefined institutions and succeeds when a non-SuperAdmin selects one of them.",
        "Existing role-based institution scoping continues to work for users who already have profiles."
      ]
    },
    {
      "id": "REQ-16",
      "text": "Localize the entire frontend UI to Indonesian (Bahasa Indonesia) and remove remaining English text across navigation, page titles, form labels, placeholders, buttons, table headers, badges, dialogs, toasts, empty/loading states, and validation messages; also localize date and currency formatting to Indonesian conventions (locale id-ID, currency IDR where applicable).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "apk nya masih full bahasa inggris. gua mau apk ini pake bahasa Indonesia full."
        ]
      },
      "acceptanceCriteria": [
        "No user-facing UI strings remain in English in the main user flows (dashboard, students, payments, reports, settings, auth/profile setup).",
        "Toasts currently in English (e.g., profile creation, student/payment deletion errors/success) display Indonesian text.",
        "Dates shown in tables/details use Indonesian locale formatting (id-ID).",
        "Amounts are formatted as IDR consistently (e.g., Rp with Indonesian thousands separators)."
      ]
    },
    {
      "id": "REQ-17",
      "text": "Ensure every Institution/Lembaga dropdown and filter in the frontend correctly loads and displays the available institutions (SMP & SMA) with clear Indonesian labels, including ProfileSetupModal and Student create/edit forms; handle loading and error states so the dropdown never appears silently empty.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "dropdown lembaga itu belum ada SMP atau SMA masih kosong"
        ]
      },
      "acceptanceCriteria": [
        "In ProfileSetupModal, the Institution (Lembaga) select shows the two institution options once loaded; while loading it shows an explicit Indonesian loading state, and on error it shows an explicit Indonesian error state.",
        "In StudentFormPage create mode, the Lembaga select shows the two institution options once loaded (or the user’s scoped institution when applicable), with clear Indonesian placeholder text.",
        "If listInstitutions returns an empty array, the UI shows an Indonesian explanation instead of an empty dropdown with no context."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only UI components); compose them as-is.",
    "Do not modify frontend immutable hook entrypoints (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx).",
    "Backend must remain a single Motoko actor in backend/main.mo; only add migration logic in backend/migration.mo if strictly required for existing state upgrades."
  ],
  "nonGoals": [
    "Adding new product features beyond Indonesian localization and fixing institution dropdown population.",
    "Implementing new authentication providers (only Internet Identity is supported).",
    "Introducing external databases or third-party localization services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}