{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "SPP Sekolah — Lokalisasi Bahasa Indonesia & perbaikan dropdown Lembaga",
  "requirements": [
    {
      "id": "REQ-16",
      "summary": "Lokalisasi seluruh UI frontend ke Bahasa Indonesia serta format tanggal (id-ID) dan mata uang (IDR) secara konsisten.",
      "acceptanceCriteria": [
        "Tidak ada string UI yang terlihat pengguna masih berbahasa Inggris pada alur utama (dashboard, santri, pembayaran, laporan, pengaturan, auth/setup profil).",
        "Toast yang sebelumnya berbahasa Inggris tampil dalam Bahasa Indonesia.",
        "Tanggal di tabel/detail menggunakan format locale Indonesia (id-ID).",
        "Nominal uang terformat konsisten sebagai IDR (Rp dengan pemisah ribuan Indonesia)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/formatters.ts",
          "operation": "create",
          "description": "Tambahkan util formatter terpusat untuk tanggal dan rupiah berbasis Intl (locale id-ID) agar seluruh halaman memakai format yang konsisten."
        },
        {
          "path": "frontend/src/components/layout/AdminLayout.tsx",
          "operation": "modify",
          "description": "Ubah teks navigasi/sidebar, label aplikasi, dan footer yang masih Inggris menjadi Bahasa Indonesia; pastikan tidak ada string UI Inggris tersisa pada layout."
        },
        {
          "path": "frontend/src/components/auth/LoginButton.tsx",
          "operation": "modify",
          "description": "Lokalisasi label tombol login/logout serta state 'logging-in' menjadi Bahasa Indonesia, dan pastikan pesan error yang ditampilkan pengguna tidak berbahasa Inggris. (Gunakan komponen authorization untuk alur autentikasi yang sudah ada; Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/auth/RequireAuth.tsx",
          "operation": "modify",
          "description": "Lokalisasi seluruh copy untuk layar/section yang memblokir akses ketika belum login (judul, deskripsi, CTA) ke Bahasa Indonesia. (Gunakan komponen authorization untuk gating akses; Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/components/auth/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Lokalisasi judul, deskripsi, label form, placeholder, validasi, tombol, dan toast sukses/gagal menjadi Bahasa Indonesia; pastikan tidak ada string Inggris tersisa. (Gunakan komponen authorization untuk alur setup profil; Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/dashboard/DashboardPage.tsx",
          "operation": "modify",
          "description": "Lokalisasi judul, deskripsi, kartu statistik, label chart, dan CTA ke Bahasa Indonesia; ubah format bulan/tanggal chart menjadi id-ID dan rapikan tampilan nominal dengan formatter Rupiah dari utils."
        },
        {
          "path": "frontend/src/pages/students/StudentsListPage.tsx",
          "operation": "modify",
          "description": "Lokalisasi judul, deskripsi, tombol, placeholder pencarian, empty/loading states, badge status (Active/Graduated), dialog konfirmasi, serta toast menjadi Bahasa Indonesia."
        },
        {
          "path": "frontend/src/pages/students/StudentFormPage.tsx",
          "operation": "modify",
          "description": "Lokalisasi semua label/placeholder/tombol/validasi/toast pada form tambah/ubah santri ke Bahasa Indonesia, termasuk teks tombol 'Saving/Save/Cancel' dan judul halaman."
        },
        {
          "path": "frontend/src/pages/students/StudentDetailPage.tsx",
          "operation": "modify",
          "description": "Lokalisasi teks loading/not-found, label detail, tombol, dan tabel riwayat pembayaran ke Bahasa Indonesia; gunakan formatter tanggal dan Rupiah untuk kolom yang relevan."
        },
        {
          "path": "frontend/src/pages/payments/PaymentsListPage.tsx",
          "operation": "modify",
          "description": "Lokalisasi judul, deskripsi, tombol, placeholder pencarian, header tabel, dialog konfirmasi hapus, loading/empty state, serta toast; gunakan formatter id-ID untuk tanggal dan IDR untuk nominal."
        },
        {
          "path": "frontend/src/pages/payments/PaymentFormPage.tsx",
          "operation": "modify",
          "description": "Lokalisasi seluruh label/placeholder/tombol/validasi/toast pada form pembayaran; terjemahkan metode pembayaran (Cash/Transfer) menjadi label Indonesia dan gunakan format id-ID untuk input/preview yang relevan."
        },
        {
          "path": "frontend/src/pages/payments/PaymentDetailPage.tsx",
          "operation": "modify",
          "description": "Lokalisasi label detail dan aksi (print/download/edit/back, dll) serta state loading/not-found; format tanggal dengan id-ID dan nominal dengan Rupiah."
        },
        {
          "path": "frontend/src/pages/reports/ReportsIndexPage.tsx",
          "operation": "modify",
          "description": "Lokalisasi judul, deskripsi, nama kartu laporan, CTA, dan empty/placeholder text ke Bahasa Indonesia."
        },
        {
          "path": "frontend/src/pages/reports/MonthlyRecapReportPage.tsx",
          "operation": "modify",
          "description": "Lokalisasi copy placeholder, tombol, dan navigasi laporan bulanan ke Bahasa Indonesia."
        },
        {
          "path": "frontend/src/pages/reports/ClassRecapReportPage.tsx",
          "operation": "modify",
          "description": "Lokalisasi copy placeholder, tombol, dan navigasi rekap kelas ke Bahasa Indonesia."
        },
        {
          "path": "frontend/src/pages/reports/InstitutionRecapReportPage.tsx",
          "operation": "modify",
          "description": "Lokalisasi copy placeholder, tombol, dan navigasi rekap lembaga ke Bahasa Indonesia."
        },
        {
          "path": "frontend/src/pages/reports/ArrearsReportPage.tsx",
          "operation": "modify",
          "description": "Lokalisasi copy placeholder, tombol, dan navigasi laporan tunggakan ke Bahasa Indonesia."
        },
        {
          "path": "frontend/src/pages/settings/SppSettingsPage.tsx",
          "operation": "modify",
          "description": "Lokalisasi judul, deskripsi, placeholder/empty state, dan tombol pada halaman pengaturan SPP ke Bahasa Indonesia."
        },
        {
          "path": "frontend/src/pages/calendar/PaymentCalendarPage.tsx",
          "operation": "modify",
          "description": "Lokalisasi copy placeholder kalender pembayaran ke Bahasa Indonesia."
        }
      ]
    },
    {
      "id": "REQ-17",
      "summary": "Pastikan seluruh dropdown/filter Lembaga memuat dan menampilkan lembaga (SMP & SMA) dengan state loading/error/empty yang jelas dan tidak pernah terlihat kosong tanpa konteks.",
      "acceptanceCriteria": [
        "Di ProfileSetupModal, select Lembaga menampilkan dua opsi setelah loaded; saat loading tampil state loading Bahasa Indonesia; saat error tampil state error Bahasa Indonesia.",
        "Di StudentFormPage mode create, select Lembaga menampilkan opsi lembaga setelah loaded (atau lembaga ter-scope bila berlaku) dengan placeholder Bahasa Indonesia yang jelas.",
        "Jika listInstitutions mengembalikan array kosong, UI menampilkan penjelasan Bahasa Indonesia (bukan dropdown kosong tanpa konteks)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Perkaya hook useListInstitutions agar komponen pemakai dapat mengakses state isLoading/isError/error dengan jelas dan dapat mengatur UX (loading/error/empty) tanpa dropdown tampak kosong."
        },
        {
          "path": "frontend/src/components/auth/ProfileSetupModal.tsx",
          "operation": "modify",
          "description": "Perbaiki UI Select Lembaga: tampilkan placeholder 'Memuat data lembaga…' saat loading, tampilkan pesan error Indonesia saat gagal, dan tampilkan penjelasan saat hasil kosong; tetap tampilkan dua opsi lembaga bila tersedia. (Gunakan komponen authorization untuk alur setup profil; Verify the component's usage instructions before implementing.)"
        },
        {
          "path": "frontend/src/pages/students/StudentFormPage.tsx",
          "operation": "modify",
          "description": "Perbaiki Select Lembaga pada mode create: gunakan state dari useListInstitutions untuk menampilkan loading/error/empty messages dalam Bahasa Indonesia, dan pastikan placeholder tidak membingungkan ketika data belum tersedia."
        },
        {
          "path": "frontend/src/pages/payments/PaymentFormPage.tsx",
          "operation": "modify",
          "description": "Pastikan Select Lembaga pada form pembayaran (mode create) menangani loading/error/empty dengan teks Bahasa Indonesia sehingga tidak tampak kosong tanpa konteks, sekaligus tetap menampilkan opsi lembaga ketika data sudah tersedia."
        }
      ]
    }
  ]
}